import "../../sass/components/_title.scss";
import "../../sass/components/_modal.scss";
import { MdArrowForwardIos } from "react-icons/md";

interface PublicOfferProps {
  onBackdropClick: () => void;
}

const PublicOffer: React.FC<PublicOfferProps> = ({ onBackdropClick }) => {
  return (
    <div className=" modal__container">
      <button
        type="button"
        onClick={onBackdropClick}
        className="modal__arrowforward"
      >
        <MdArrowForwardIos />
      </button>
      <h1 className="modal__title  title ">
      ПУБЛІЧНА ОФЕРТА (ДОГОВІР) про надання послуг оренди приміщення студії
      </h1>
      <ul className="modal__list">
        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">Загальні положення</h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                Фізична особа – підприємець Трачук Олена Миколаївна, що є платником
                єдиного податку  та діє на підставі Виписки  з Єдиного державного
                реєстру юридичних осіб, фізичних осіб-підприємців та громадських
                формувань № 2010350010001597591 дата 25.07.2024 року, що іменується
                надалі – «Орендар», з однієї сторони, і будь-яка фізична особа,
                фізична  особа – підприємець, яка приєднається до цього Договору,
                у спосіб визначений даним Договором, іменована надалі «Орендар»
                чи/або «Клієнт», з іншої сторони, в подальшому разом за текстом
                також іменуються як «Сторони», а кожен окремо як «Сторона»,
                відповідно до вимог ст. 633 Цивільного кодексу України, уклали
                даний Договір про надання послуг оренди приміщення студії
                (надалі – «Договір») про наступне:
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          1.ТЕРМІНИ ТА ПОНЯТТЯ
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                1.1. Договір публічної оферти з надання послуг оренди приміщення
                студії - це договір, відповідно до якого Орендар бере на себе
                обов’язок здійснювати надання в оренду приміщення студії кожному,
                хто до нього звернеться, при цьому умови цього договору встановлюються
                однаковими для всіх Орендарів. Орендар не має права надавати переваги
                одному Орендарю перед іншим щодо укладення цього договору, якщо інше
                не встановлено законодавством.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                1.2. Договір приєднання до договору публічної оферти з надання послуг
                оренди приміщення студії - це договір, умови якого встановлені Орендарем
                у договорі публічної оферти з надання послуг оренди приміщення студії,
                який може бути укладений лише шляхом приєднання Орендаря до запропонованого
                договору публічної оферти в цілому, через оплату послуг суборенди приміщення
                студії. Орендар не може запропонувати свої умови договору.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          2. ПРЕДМЕТ ДОГОВОРУ
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                2.1. В порядку та на умовах, визначених даним договором,
                Орендар зобов'язується надати, Орендарю послуги :а саме
                послуги  з суборенди приміщення  фотостудії “FOCUS PHOTOLAB”,
                надалі за текстом – “Студія”, яка розташована за адресою:
                м. Дніпро, вулиця Троїцька, 21-Г, - для здійснення фото
                та відеозйомки.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                2.2. Укладаючи цей Договір, Орендар автоматично погоджується
                з повним та безумовним прийняттям Правил та умов суборенди
                приміщення студії.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                2.3. Користування Студією здійснюється Орендарем строго у
                відповідності до умов цього Договору, Правил користування
                фотостудією, які є невід’ємною частиною цього Договору, а
                також у відповідності до норм етики і суспільної моралі
                відповідно до чинного законодавства України.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          3. ПОРЯДОК  БРОНЮВАННЯ, РЕЗЕРВУВАННЯ ТА  НАДАННЯ ПОСЛУГ
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                3.1 Замовлення послуг починається після online-бронювання Клієнтом
                послуги на web-сайті Орендаря https://focus-photolab.netlify.app/
                шляхом акцепту (прийняття) умов даного Договору, без його письмового
                підписання Сторонами. Дійсний Договір має юридичну силу відповідно до
                ст.633 ЦК України і є рівносильним Договору, підписаному Сторонами.
                Відповідно, Орендар, який здійснив online-бронювання на сайті та
                оплатив замовлені Послуги за цим Договором вважається ознайомленим
                з даним Договором та таким, що погоджується з усіма його умовами.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
              3.2. Online-бронювання: 
              - бронь вважається дійсною тільки після внесення оплати; 
              - якщо обраний період броні «з сьогодні на сьогодні», то час оплати 30 хвилин; 
              - якщо обраний період броні «на найближчі 5 днів», то час оплати 3 години; 
              - якщо обраний період броні «за більш ніж 5 днів», то час оплати 24 години;
              - по закінченню відведеного часу на оплату - бронь знімається автоматично; 
              - до оплати розраховується тільки користування Студією в Студії (додаткові
                послуги, обладнання необхідно вказати в заявці при бронюванні);
              - оплата додаткових послуг та додаткового обладнання здійснюється на місці
                в Студії в готівковому та/або безготівковому порядку;
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
              3.3. Початком суборенди студії вважається попередньо заброньований час. 
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                3.4. У разі запізнення Орендаря заброньований час не продовжується!!!!!!
                Якщо Орендар запізнюється більш ніж на 30 хвилин і не попередив про це,
                вважається, що Орендар не з'явився на зйомку. Отримана оплата не повертається.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                3.5. Якщо після заброньованого часу студія вільна, ви можете продовжити
                орендований час (уточнивши  цю можливість у Орендаря студії до початку зйомки).
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                3.6. Після закінчення зйомки, всі учасники фотосесії повинні покинути Студію.
                Клієнт який уклав Договір, прибирає Студію і залишається в студії до завершення
                її перевірки Орендарем. Зйомка закінчується за 5 хвилин до закінчення типу
                броньованого часу (якщо немає кардинальних змін в декораціях студії і не потрібно
                прибирання).
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                3.7. Закінченням користування Студії вважається момент, коли Орендар закінчить
                перевірку працездатності орендованого обладнання та реквізиту переданого за
                цим Договором в користування.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          4. ПРАВА ТА ОБОВЯЗКИ СТОРІН
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                Клієнт, бронюючи студію, погоджується з правилами, та зобов’язується
                виконувати всі умови студії. Також, кожен відвідувач погоджується з
                правилами та несе відповідальність за себе та малолітніх дітей перебуваючи
                з ними в студії.
                За техніку безпеки та матеріально- відповідальною особою за своїх клієнтів
                і виконання правил студії є особа яка проводить зйомку чи організовує захід.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.1. Орендар зобов’язаний:
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.1.1. доводити до відома своїх уповноважених представників необхідну
                і отриману від Орендаря інформацію щодо послуг оренди та Правил оренди.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.1.2. у випадку відповідних порушень Правил оренди сплатити
                штрафи, що встановлені цим Договором та Правилами оренди.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.1.3. дотримуватись правил пожежної безпеки, санітарного та
                епідеміологічного благополуччя, охорони праці тощо та нести
                відповідальність у повному обсязі за виконання відповідних
                нормативних актів в процесі оренди;
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.1.4. у випадку псування або забруднення майна, реквізиту
                Орендарем чи/аби його уповноваженими представниками, Орендар
                зобов’язаний сплатити Орендарю суму, еквівалентну ринкової
                вартості ремонту, чищення або заміни відповідного майна
                чи/або реквізиту;
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.1.5 Орендар  під час суборенди несе повну та виключну
                відповідальність за недотримання вимог чинного законодавства,
                в тому числі розпоряджень, постанов, наказів Кабінету
                міністрів України та інших органів виконавчої влади;
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.1.6. Орендар  під час суборенди несе повну та виключну
                відповідальність за всі свої дії та дії уповноважених
                представників Орендаря.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
              4.2. Орендар зобов’язаний:
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.2.1. надати Клієнту чи/або уповноваженим представникам Клієнта,
                шляхом розміщення на офіційній сторінці в Інтернеті.Необхідну і
                достовірну інформацію про послуги оренди, приміщення студії ціни
                на послуги тощо;
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.2.2. інформувати Клієнта чи/або уповноважених представників Клієнта
                з Правилами оренди;
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
              4.3. Орендар має право:
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.3.1. у випадку відповідних порушень Правил оренди стягнути з Клієнта штрафи,
                які встановлені цим Договором та Правилами оренди;
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                4.3.2. відмовити Клієнту чи/або уповноваженому представнику Клієнта в наданні
                послуг оренди чи розірвати Договір, у випадках передбачених Правилами суборенди
                чи/або цим Договором, а також, якщо Клієнт чи/або уповноважений представник
                Клієнта, порушує Правила оренди, що призводить чи може призвести до матеріальних
                збитків чи створює незручності для інших Орендарів.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          5. ПРАВИЛА РОБОТИ У ФОТОСТУДІЇ
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                5.1. Правила роботи  та умови оренди фотостудії визначаються у
                Додатку №1 до цього Договору з урахуванням особливостей, визначених
                даним Розділом.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                5.2. У Студії категорично забороняється участь неповнолітніх моделей,
                незалежно від статевої приналежності, в зйомках сексуального чи
                еротичного характеру (ст.7 Закону України «Про захист суспільної моралі»).
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                5.3. У Студії категорично заборонені зйомки порнографічного характеру
                (ст.301 Кримінального кодексу України, ст.7 Закону України «Про захист
                суспільної моралі»).
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                5.4. Робота в Студії можлива тільки в чистому змінному взутті. Орендар
                повинен попередити моделей (третіх осіб) про необхідність мати чисте взуття.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                5.5. Використання будь-яких спец ефектів (дим, рідина, мильні бульбашки, конфетті
                і т.д.) на знімальному майданчику вимагає узгодження з адміністрацією студії.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                5.6. Орендар в праві зайти на знімальний майданчик для контролю. Якщо по особливості
                роботи Клієнта  це незручно – Орендар повинен узгодити це заздалегідь, до початку
                зйомки.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                5.7. Весь реквізит після зйомки повинен знаходитися на своїх місцях.
                388. Все, що явно не прописано в цьому Договорі, вимагає попереднього
                узгодження з Орендарем.
              </p>
            </li>
          </ul>
        </li>


        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          6. ВАРТІСТЬ ПОСЛУГ І ПОРЯДОК ОПЛАТИ
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                6.1. Ціни на послуги суборенди приміщення студії, які пропонуються
                Орендарем, визначаються у гривні.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
              6.2. Оплата за послуги суборенди приміщення студії здійснюється тільки online.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                6.3. Клієнт  здійснює оплату Послуги за тарифами, встановленими
                Орендрем у формі при online бронюванні Послуги за цим Договором.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                6.4. Орендар залишає за собою право змінювати встановлені тарифи у
                разі змінення ринкових умов або за інших суттєвих обставин. Клієнт
                на свій розсуд обирає тариф, із передбачених діючих, відповідно до
                якого він буде здійснювати оплату Послуги.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
              6.5. Оплата послуг здійснюється на умовах повної оплати.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                6.6. Оплата послуг здійснюється Орендарем на online сервісі
                через будь-який безпечний платіжний сервіс шляхом перерахування
                коштів на банківський рахунок Орендаря.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                6.7. Якщо Клієнт відмовляється або переносить бронювання більше
                ніж за 48 годин вам повертається ПОВНА вартість, при відміні більше
                ніж за 24 години – ПОЛОВИНА вартості, при відміні менше ніж за 24
                години – вартість НЕ ПОВЕРТАЄТЬСЯ.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                6.8. Якщо Клієнт відмовляється від бронювання, переносить час або дату
                бронювання, скорочує час надання послуг менше ніж за 72 години, то
                Орендар залишає за собою право утримати 100% оплати, якщо не знайде
                заміну на попередньо заброньований Клієнтом час.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          7. ВІДПОВІДАЛЬНІСТЬ СТОРІН
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                7.1. У випадку порушення своїх зобов’язань за цим Договором, Сторони
                несуть відповідальність відповідно до чинного законодавства України.
                Порушенням зобов’язання є його невиконання або неналежне виконання,
                тобто виконання з порушенням умов, визначених змістом
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                7.2. За псування і поломку обладнання, аксесуарів, інтер'єру, реквізитів
                і всієї іншої власності фотостудії, Орендар несе повну матеріальну
                відповідальність і відшкодовує збитки в розмірі вартості майна.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                7.3. За недотримання правил використання світла, та/або падіння освітлювального
                приладу, без видимих пошкоджень Клієнт сплачує Орендарю або його представнику
                штраф в розмірі 1000,00 грн. на місці, одразу після закінчення терміну користування
                Студією.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                7.4. Після закінчення терміну користування студія повинна бути в тому ж вигляді, що і
                на початку фотозйомки.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                7.5. Все обладнання Студії знаходиться в справному стані. Починаючи роботу в студії,
                Орендар приймає умови Договору і несе повну відповідальність за будь-які події, що
                відбуваються, а також їх наслідки (техніка безпеки, договірні відносини з клієнтами,
                дії клієнтів і т.д).
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                7.6. У випадку будь-яких претензій з боку Клієнта до обладнання
                та/або предметів інтер’єру Студії Замовник зобов’язаний до проведення
                фотозйомки повідомити про це Орендаря.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                7.7. У разі пошкодження майна Студії, Клієнт несе повну відповідальність
                в рамках чинного законодавства України.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                7.8. Відшкодування шкоди, завданої Студії та майну, відбувається валюті у
                гривневому еквіваленті за курсом долара США до гривні, встановленого Національним банком України на дату оплати.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          8. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ (ФОРС-МАЖОР)
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                8.1. Сторони звільняються від відповідальності за повне або
                часткове невиконання своїх зобов’язань за цим Договором,
                якщо таке невиконання стало наслідком обставин непереборної
                сили, що виникли після укладання цього Договору та які
                Сторони не могли ані передбачити, ані попередити розумними
                заходами.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                8.2. Обставинами непереборної сили Сторони погодилися вважати:
                повені, землетруси, пожежі, інші стихійні лиха, вибухи, виходи
                з ладу та ушкодження транспортних засобів, страйки, саботажі,
                локаут і інші засоби, що вплинули на виконання умов цього
                Договору, війну, воєнні дії, акти тероризму, страйки, масове
                безладдя, законні та незаконні дії органів державної влади,
                економічна блокада, карантин тощо. ,  що знаходяться поза
                розумним контролем Сторін
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                8.3. У випадку настання обставин непереборної сили, Сторона,
                що зазнала їх впливу, повинна негайно за допомогою будь-яких
                доступних засобів повідомити про такі обставини іншу Сторону
                в максимально стислий строк.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                8.4. Підтвердження форс-мажорних обставин здійснюється компетентними
                органами.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                8.5. Сторони поновлюють виконання своїх обов’язків, передбачених цим Договором,
                після припинення дій форс-мажорних обставин.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                8.6. До форс-мажорних обставин не можуть бути віднесені обставини, причиною яких
                є недогляд, неуважність, халатність, невиконання або неналежне виконання своїх
                обов’язків відповідною Стороною.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          9. ПОРЯДОК ВИРІШЕННЯ СУПЕРЕЧОК
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                9.1. Всі розбіжності, які можуть виникнути в ході виконання
                даного Договору Сторони зобов’язуються вирішувати шляхом
                двосторонніх переговорів, а у випадку недосягнення згоди –
                згідно з чинним Законодавством України.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                9.2. Якщо спір неможливо вирішити шляхом переговорів, він
                вирішується в судовому порядку за встановленою підвідомчістю
                та підсудністю такого спору відповідно до чинного законодавства
                України.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                9.3. Сторони погодили, що усі спори між ними з яких не було досягнуто
                згоди, розв’язуються у відповідності з чинним законодавством України.
              </p>
            </li>
          </ul>
        </li>

        <li className="modal__item">
          <h2 className="modal__subtitle subtitle">
          10.ПРИКІНЦЕВІ ПОЛОЖЕННЯ
          </h2>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
                10.1. За умовами цього Договору Клієнт стверджує, що ознайомлений та
                зобов’язується дотримуватись Правил суборенди, що мають силу договору
                приєднання та є затвердженими Орендарем у визначеному законом порядку.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                10.2. Студія обладнана камерами відеоспостереження. Клієнт обізнаний
                про відеоспостереження, а також дає свою угоду на відеоспостереження
                в студії під час виконання цього Договору.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                10.3. Клієнт повністю приймає на себе відповідальність за стан свого
                здоров'я і стан здоров'я його (та/чи залучених) неповнолітніх/малолітніх
                дітей, які відвідують фотостудію разом з ним. Виконавець не несе
                відповідальність за шкоду, пов'язану з будь-яким погіршенням здоров'я
                Замовника і за травми, отримані під час користування Студією або фотосесії.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                10.4. Клієнт дає свою згоду на обробку Орендарем своїх персональних даних та/або
                інформації, наданої ним Клієнтом. Орендар тим самим підтверджує, що повідомлений
                про свої права, пов’язані із зберіганням та обробкою своїх персональних даних,
                визначених чинним законодавством, осіб, яким передаються персональні дані, цілі
                збору даних, а саме: з метою забезпечення надання послуг з суборенди в об’ємі
                необхідному для досягнення зазначеної мети, а також підтверджує свою обізнаність
                у правах, визначених у ст. 8 закону України «Про захист персональних даних».
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                10.5. Право визначення об’єму обробки персональних даних Клієнт надає Орендарю.
                Включення персональних даних Клієнта до бази персональних даних відбувається з
                моменту укладання договору приєднання.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                10.6. Клієнт засвідчує свою обізнаність про таке включення, про свої права,
                визначені у законі України «Про захист персональних даних», про мету збору
                даних та осіб, яким передаються його персональні дані.
              </p>
            </li>
            <li className="modal__subitem">
              <p className="modal__text">
                10.7. Усвідомлюючи обсяг та характер зобов‘язань Орендаря щодо збереження даних
                банківської картки, Клієнт чи/або його уповноважений представник також надає
                Орендарю згоду здійснювати збереження інформації про них, що стала відомою
                Орендарю у процесі виконання умов Договору.
              </p>
            </li>
          </ul>
        </li>



        <li className="modal__item">
          <span className="modal__subtitle subtitle">
          11. АДРЕСА ТА РЕКВІЗИТИ
          </span>
          <ul className="modal__sublist">
            <li className="modal__subitem">
              <p className="modal__text">
              Фізична особа-підприємець Трачук Олена Миколаївна
              IBAN UA493220010000026003340121072
              ІПН/ЄДРПОУ 3585303245
              Акціонерне товариствоУНІВЕРСАЛ БАНК
              МФО 322001
              ЄДРПОУ Банку 21133352
              Адреса: м. Дніпро, вулиця Троїцька, 21-Г 

              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                У разі виникнення спорів або непорозумінь, сторони зобов'язані
                вирішувати їх шляхом переговорів.
              </p>
            </li>
            <li className="modal__item">
              <p className="modal__text">
                Реєстраційний номер облікової картки платника податків з Державного
                реєстру фізичних осіб-платників податків: 3585303245
              </p>
            </li>
          </ul>
        </li>
      </ul>
    </div>
  );
};

export default PublicOffer;
